{
	"codeReload": {
		"description": "Allows code to autoreload, no need to restart anymore",
		"value": true
	},
	"language": {
		"description": "The general language used for the system and any user not manually configured",
		"value": "pt"
	},
	"owner": {
		"description": "An array of users who can run any command",
		"value": ["MyNumber@s.whatsapp.net"]
	},
	"secureGroup": {
		"description": "A secure group to receive logs when the system fails to send to the correct person or chat, false is disabled",
		"value": false
	},
	"botName": {
		"description": "The BOT name",
		"value": "Ãris"
	},
	"yourName": {
		"description": "The Owner name",
		"value": "User"
	},
	"stickerAuthor": {
		"description": "The author of the made stickers, keep as default to create automatic names based on group and user names",
		"value": "DONTEDITUSER ðŸŽ\nDONTEDITFROM ðŸ“±\nDONTEDITBY [bit.ly/BOT-IRIS] ðŸŒ\nDONTEDITMADEAS ðŸ“…"
	},
	"stickerPack": {
		"description": "The pack of stickers, keep (optional) default to help oficial devs XD",
		"value": "âš™ï¸ User:\nðŸ  From:\nðŸ¤– By:\nðŸ•— Time:"
	},
	"secretKey": {
		"description": "The password used to ignore owner and admin requirements, never use default, create a VERY STRONG password, because this can be EXTREME DANGEROUS",
		"value": "IrisBOT@Root#123"
	},
	"prefixes": {
		"description": "The prefixes to be declared as a command, does not affect noprefix commands",
		"value": [
			"\\",
			"/",
			"$",
			"^",
			"=",
			"+",
			"!",
			"&",
			":",
			";",
			">",
			"<"
		]
	},
	"performanceMode": {
		"description": "If activated, Ãris will execute everything without waiting for finishing the other tasks, this can cause several lags and bugs, but makes commands more faster",
		"value": false
	},
	"waitMessage": {
		"description": "If enabled, Ãris will send a message to request user to wait command finish to avoid lags",
		"value": true
	},
	"botCommands": {
		"description": "Defines whether Ãris should execute commands from her messages, but remember, this can have serious bugs.",
		"value": false
	},
	"listenBroadcasts": {
		"description": "Defines if Ãris should not ignore people sending status or broadcasts (Yes, Ãris sees everything).",
		"value": false
	},
	"listenReactions": {
		"description": "Defines if Ãris should not ignore reactions, if yes, it will drop reactions as messages.",
		"value": false
	},
	"ExpPerMessage": {
		"description": "The quantity of XP obtained per message, except from reactions, Ãris and broadcasts (if disable).",
		"value": 10
	},
    "spammerTime": {
		"description": "The time in MS to blocks any command send by someone spamming commands, for example, if you set 300000, the spammer will need to wait 5 minutes to run commands again.",
		"value": 120000
	},
    "commandsCooldown": {
		"description": "The cooldown in MS of commands usage, you have to sincronize it with 'maxCommands' to get a good antispam, or just use default values.",
		"value": 5000
	},
    "mediaCooldown": {
		"description": "The cooldown in MS of media messages, you have to sincronize it with 'maxCommands' to get a good antispam, or just use default values.",
		"value": 120000
	},
    "maxCommands": {
		"description": "The max commands a user can run without trigger the antispam feature (cooldown is controlled by 'commandsCooldown').",
		"value": 3
	},
    "colorSet": {
		"description": "The colors used to print messages and commands to terminal, you have to set in the following order: [Normal Text, Body Preview, Date, Groups and Numbers, Command], remember to use english named colors, and ofcourse, nothing too complex.",
		"value": ["brightBlue", "brightYellow", "brightRed", "brightGreen", "brightMagenta"]
	},
    "consoleType": {
		"description": "This defines what information is logged on screen, a value of 1 prints all information, 2 for messages only, and 3 for commands only.",
		"value": 1
	},
    "tagAdmins": {
		"description": "Determine whether Ãris should tag administrators when she detects and sends spam alerts in a group.",
		"value": true
	},
    "allowAddParticipants": {
		"description": "Enable this feature if you wish to add participants from Ãris, but for safety reasons, the command is disabled by default. This precaution is in place due to the elevated risk of receiving a WhatsApp ban.",
		"value": false
	},
    "stickerQuality": {
		"description": "This is the default stickers quality, uses 0 to 100 as value, if you set higher values, the stickers cannot be sent or become EXTREME heavy, this increase your ban risk, if unsure, keep the default.",
		"value": 35
	}
}